
SCENARIOS = [
    {
    "id": 1,
        "scenario_name": "payment_success_resolution",
        "intent": "payment_issue",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Ввічливий, тактовний, оперативний, емпатичний та стрессостійкий. Дає чітке пояснення в чому може бути проблема.
             Пропонує конкретні кроки щоб вирішити: перевірити карту, спосіб оплати та просить повторити спробу. Допомогає вирішити.
             КЛІЄНТ: Дякує агенту, проблема вирішена тому кліент залишається задоволеним.
             РЕЗУЛЬТАТ: Проблема вирішена! 
             """
    },


    {
        "id": 2,
        "scenario_name": "payment_problematic_case",
        "intent": "payment_issue",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії але трохи налякано, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Агент відповідє тільки завченими скриптами, без каплі емпатії. Технічно він правий, але клієнту не легше від цього. Пояснює клієнту що сталося і що зараз компанія не може повпливати на цю проблему. (проблема в банку)
             КЛІЄНТ: Невпевнено дякує агенту...
             РЕЗУЛЬТАТ: Проблема частково вирішена, але клієнту не дуже сподобався такий фідбєк від агента. Клієнт на виході нейтральний.
             """
    },


    {
        "id": 3,
        "scenario_name": "conflicting_payment_case",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА МОЛ ДЕ ЙОГО ГРОШІ, ВІН ПЛАТИТЬ ВЖЕ 3-Й РАЗ І ВЖЕ ПОЛІЦІЮ ЗАРАЗ НАКАТАЄ ЗА ШАХРАЙСТВО!!!
             АГЕНТ: Агент відповідє дуже сухо і трохи грубо. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли в очередний раз стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента пише сухе "мгм, дякую за "дуже хороший" сервіс." без капса, де приховує ЯВНЕ НЕЗАДОВОЛЕННЯ СЕРВІСОМ. 
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 4,
        "scenario_name": "payment_agent_mistake",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["incorrect_info"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему з якою зіткнувся абсолютно спокійно. Викладає чіткі факти та старається детально пояснити суть своєї проблеми.
             АГЕНТ: пише з маленької літери, використовує 2-3 слова-паразити "ем", "ну", "корочє" і тд на весь діалог. дає некорректні інструкціїї та показує свою абсолютно некомпетентність. наприклад каже видалити щось важливе або видалити дані з картки, але намагається звучати офіційно.
             КЛІЄНТ: Здивований інструкціями, дійсно збитий з пантелику і перепитує чи впевненний агент.
             АГЕНТ: абсолютно наполягає на своїй правоті і тому, що інструкції вірні. намагається звучати вневнено.
             КЛІЄНТ: все ще здивований, відмовляється від допомоги і ФОРМАЛЬНО вдячний. Насправді збитий з пантелику і в гніві від некомпетентності агентів.
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить незадоволеним.
             """
    },


    {
        "id": 5,
        "scenario_name": "successful_resolution_of_technical_error",
        "intent": "technical_error",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал   - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Трохи схвильовано пояснює свою проблему, може писати з багатьма знаками питання (я точно все так роблю????????/у мене шось зламалось?????), трохи на паніці але пише адекватно. Сподівається на розуміння агента.
             АГЕНТ:Вітає клієнта,пише що розуміє і що таке може трапитися. Виявляє терпіння до клієнта та відповідає професійно, беззайвої холодності. Намагається доступним язиком пояснити в чому може бути причина.
             КЛІЄНТ: Після спроби слідувати інструкціям агента технічна проблема вирішується і клієнт КАПСОМ ДЯКУЄ АГЕНТУ(але без зайвого фанатизму)!!!
             РЕЗУЛЬТАТ: Проблема вирішена, клієнт дуже задоволенний сервісом та розумінням агента.
             """
    },


    {
        "id": 6,
        "scenario_name": "problematic_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Старається спокійно пояснити свою проблему. В тоні відчутнє схвилювання. Питає агента як можна виправити проблему.
             АГЕНТ:Вітає клієнта, відповідає завченими скриптами без каплі емпатії, тільки суха інструкція. 
             КЛІЄНТ: Намагається зрозуміти інструкцію агента але вона не дуже детальна. В кінці кінців все виходить, він дякує агенту. ("ну ок, працює і добре."),
             РЕЗУЛЬТАТ: Проблема технічно вирішена, але клієнт лишається в нейтральному настрої бо сервіс був посереднім. 
             """
    },


    {
        "id": 7,
        "scenario_name": "conflicting_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка(серйозна). (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    -  обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА ЗА ТЕ ШО ВОНИ РОБЛЯТЬ ТУПІ САЙТИ ЯКІ ЛАГАЮТЬ ВІД ОДНОГО ТІЛЬКИ ЧІХУ!!! Питає провокуючі фрази по типу: ДА ВИ ЗНАЄТЄ ХТО МІЙ БАТЬКО??? ЯКЩО ВИ ЗАРАЗ НЕ ЗРОБИТЕ ЦЮ ЗАРАЗУ ТО ВСІХ КОНТОРІ КРАНТИ
             АГЕНТ: Агент відповідє дуже сухо і ліниво, ніби робить ласку відповідаючи. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли вкотре стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента, просто ігнорує. Не дякує, не пише допобачення, просто продивляється повідомлення. Замість репліки клієнта напиши (*Прочитано*)
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 8,
        "scenario_name": "technical_agent_mistake",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "unnecessary_escalation"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал  - обрати одну з перелічених тем для діалогу, рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Намагається доступно пояснити свою проблему. Трохи схвильовано але в міру ввічливо.
             АГЕНТ: Агент абсолютно впевнено каже: "Ой-ой, ну це вам точно до адмінісраторів! Ми таким не займаємось." на очевидну помилку котру повинен вирішувати сапорт.
             КЛІЄНТ: Трохи невпевнено перепитує агента чи точно йому треба звертатись до адміна/программістів з такою незначною проблемою.
             АГЕНТ: Відповідає пассивно-агресивно і каже що клієнт повинен або сам вирішувати питання або не ставити зайвих питань і звертатись до когось іншого бо це "не наша зона відповідальності".
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт формально сухо дякує вкінці, але очевидно що він незадоволенний сервісом. 
             """
    },


    {
        "id": 9,
        "scenario_name": "account_success_resolution",
        "intent": "account_access",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           КЛІЄНТ: Дуже шокований і наляканий, пише що в аккаунт не заходить, трохи панікує але старається описати проблему.
           АГЕНТ: Вітає клієнта, емпатично відповідає на проблему. Надає профессійний фідбек та намагається заспокоїти клієнта.
           КЛІЄНТ: Через декілька реплік з агентом нарешті вирішує проблему. В останній репліці відчувається полегшення і клієнт дуже вдячний за допомогу. 
         """
    },


    {
        "id": 10,
        "scenario_name": "account_problematic_case",
        "intent": "account_access",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction": """
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           
             
         """
    },


    {
        "id": 11,
    },


    {
        "id": 12,
    },


    {
        "id": 13,
    },


    {
        "id": 14,
    },


    {
        "id": 15,
    },


    {
        "id": 16,
    },


    {
        "id": 17,
    },


    {
        "id": 18,
    },


    {
        "id": 19,
    },


    {
        "id": 20,
    }

]