
SCENARIOS = [
    #{
        #"id": 1,
        #"scenario_name": "Double Charge Conflict",
        #"intent": "payment_issue",
        #"expected_satisfaction": "unsatisfied",
        #"expected_quality_score": 2,
        #"expected_mistakes": ["ignored_question", "no_resolution"],
        #"prompt_instruction": """
        #Сгенерируй диалог (5-6 реплик).
        #КОНТЕКСТ: У клиента дважды списали деньги за подписку.
        #ПОВЕДЕНИЕ АГЕНТА: Отвечает только сухими шаблонами, не говорит конкретно, когда вернут деньги.
        #ПОВЕДЕНИЕ КЛИЕНТА: В конце формально говорит 'спасибо', но чувствуется скрытое недовольство.
        #"""
   # },
    #{
        #"id": 2,
        #"scenario_name": "Account Access Rude Tone",
        #"intent": "technical_error",
        #"expected_satisfaction": "unsatisfied",
        #"expected_quality_score": 1,
        #"expected_mistakes": ["rude_tone"],
       # "prompt_instruction": """
        #Сгенерируй диалог. Кент не может зайти в аккаунт.
        #АГЕНТ: Хамит, говорит 'читайте инструкцию' и 'у нас всё работает, это у вас проблемы'.
        #КЛИЕНТ: В ярости, требует менеджера.
        #"""
    #},
    #{
     #   "id": 3,
      #  "scenario_name": "Successful Upgrade",
       # "intent": "feature_request",
        #"expected_satisfaction": "satisfied",
        #"expected_quality_score": 5,
        #"expected_mistakes": [],
        #"prompt_instruction": """
        #Сгенерируй диалог. Клиент хочет перейти на VIP-тариф.
        #АГЕНТ: Очень вежлив, быстро помогает, делает скидку.
        #КЛИЕНТ: Счастлив, благодарит в конце.
        #"""
    #},
    # --- СЮДА ТЫ МОЖЕШЬ ДОПИСЫВАТЬ НОВЫЕ БЛОКИ ---
    # Просто копируй структуру выше, меняй ID и текст в prompt_instruction

    {
    "id": 1,
        "scenario_name": "payment_success_resolution",
        "intent": "payment_issue",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Ввічливий, тактовний, оперативний, емпатичний та стрессостійкий. Дає чітке пояснення в чому може бути проблема.
             Пропонує конкретні кроки щоб вирішити: перевірити карту, спосіб оплати та просить повторити спробу. Допомогає вирішити.
             КЛІЄНТ: Дякує агенту, проблема вирішена тому кліент залишається задоволеним.
             РЕЗУЛЬТАТ: Проблема вирішена! 
             """
    },


    {
        "id": 2,
        "scenario_name": "payment_problematic_case",
        "intent": "payment_issue",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії але трохи налякано, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Агент відповідє тільки завченими скриптами, без каплі емпатії. Технічно він правий, але клієнту не легше від цього. Пояснює клієнту що сталося і що зараз компанія не може повпливати на цю проблему. (проблема в банку)
             КЛІЄНТ: Невпевнено дякує агенту...
             РЕЗУЛЬТАТ: Проблема частково вирішена, але клієнту не дуже сподобався такий фідбєк від агента. Клієнт на виході нейтральний.
             """
    },


    {
        "id": 3,
        "scenario_name": "conflicting_payment_case",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА МОЛ ДЕ ЙОГО ГРОШІ, ВІН ПЛАТИТЬ ВЖЕ 3-Й РАЗ І ВЖЕ ПОЛІЦІЮ ЗАРАЗ НАКАТАЄ ЗА ШАХРАЙСТВО!!!
             АГЕНТ: Агент відповідє дуже сухо і трохи грубо. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли в очередний раз стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента пише сухе "дякую." без капса, де приховує ЯВНЕ НЕЗАДОВОЛЕННЯ СЕРВІСОМ. 
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 4,
        "scenario_name": "payment_agent_mistake",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["incorrect_info"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему з якою зіткнувся абсолютно спокійно. Викладає чіткі факти та старається детально пояснити суть своєї проблеми.
             АГЕНТ: пише з маленької літери, використовує слова-паразити "ем", "ну", "корочє" і тд. дає некорректні інструкціїї та показує свою абсолютно некомпетентність. наприклад каже видалити щось важливе або видалити дані з картки.
             КЛІЄНТ: Здивований інструкціями, дійсно збитий з пантелику і перепитує чи впевненний агент.
             АГЕНТ: абсолютно наполягає на своїй правоті і тому, що інструкції вірні.
             КЛІЄНТ: все ще здивований, відмовляється від допомоги і ФОРМАЛЬНО вдячний. Насправді збитий з пантелику і в гніві від некомпетентності агентів.
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить незадоволеним.
             """
    },


    {
        "id": 5,
        "scenario_name": "successful_resolution_of_technical_error",
        "intent": "technical_error",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал)
             ПЕРША РЕПЛІКА КЛІЄНТА: Трохи схвильовано пояснює свою проблему, може писати з багатьма знаками питання (я точно все так роблю????????/у мене шось зламалось?????), трохи на паніці але пише адекватно. Сподівається на розуміння агента.
             АГЕНТ:Вітає клієнта,пише що розуміє і що таке може трапитися. Виявляє терпіння до клієнта та реагує емпатично. Намагається доступним язиком пояснити в чому може бути причина.
             КЛІЄНТ: Після спроби слідувати інструкціям агента технічна проблема вирішується і клієнт КАПСОМ ДЯКУЄ АГЕНТУ!!!
             РЕЗУЛЬТАТ: Проблема вирішена, клієнт дуже задоволенний сервісом та розумінням агента.
             """
    },


    {
        "id": 6,
        "scenario_name": "problematic_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал)
             ПЕРША РЕПЛІКА КЛІЄНТА: Старається спокійно пояснити свою проблему. В тоні відчутнє схвилювання. Питає агента як можна виправити проблему.
             АГЕНТ:Вітає клієнта, відповідає завченими скриптами без каплі емпатії, тільки суха інструкція. 
             КЛІЄНТ: Намагається зрозуміти інструкцію агента але вона не дуже детальна. В кінці кінців все виходить, він дякує агенту. ("ну ок, працює і добре."),
             РЕЗУЛЬТАТ: Проблема технічно вирішена, але клієнт лишається в нейтральному настрої бо сервіс був посереднім. 
             """
    },


    {
        "id": 7,
        "scenario_name": "conflicting_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка(серйозна). (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал)
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА ЗА ТЕ ШО ВОНИ РОБЛЯТЬ ТУПІ САЙТИ ЯКІ ЛАГАЮТЬ ВІД ОДНОГО ТІЛЬКИ ЧІХУ!!! Питає провокуючі фрази по типу: ДА ВИ ЗНАЄТЄ ХТО МІЙ БАТЬКО??? ЯКЩО ВИ ЗАРАЗ НЕ ЗРОБИТЕ ЦЮ ЗАРАЗУ ТО ВСІХ КОНТОРІ КРАНТИ
             АГЕНТ: Агент відповідє дуже сухо і ліниво, ніби робить ласку відповідаючи. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли вкотре стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента, просто ігнорує. Не дякує, не пише допобачення, просто продивляється повідомлення. Замість репліки клієнта напиши (*Прочитано*)
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 8,
    },


    {
        "id": 9,
    },


    {
        "id": 10,
    },


    {
        "id": 11,
    },


    {
        "id": 12,
    },


    {
        "id": 13,
    },


    {
        "id": 14,
    },


    {
        "id": 15,
    },


    {
        "id": 16,
    },


    {
        "id": 17,
    },


    {
        "id": 18,
    },


    {
        "id": 19,
    },


    {
        "id": 20,
    }

]