
SCENARIOS = [
    {
    "id": 1,
        "scenario_name": "payment_success_resolution",
        "intent": "payment_issue",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Ввічливий, тактовний, оперативний, емпатичний та стрессостійкий. Дає чітке пояснення в чому може бути проблема.
             Пропонує конкретні кроки щоб вирішити: перевірити карту, спосіб оплати та просить повторити спробу. Допомогає вирішити.
             КЛІЄНТ: Дякує агенту, проблема вирішена тому кліент залишається задоволеним.
             РЕЗУЛЬТАТ: Проблема вирішена! 
             """
    },


    {
        "id": 2,
        "scenario_name": "payment_problematic_case",
        "intent": "payment_issue",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії але трохи налякано, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Агент відповідє тільки завченими скриптами, без каплі емпатії. Технічно він правий, але клієнту не легше від цього. Пояснює клієнту що сталося і що зараз компанія не може повпливати на цю проблему. (проблема в банку)
             КЛІЄНТ: Невпевнено дякує агенту...
             РЕЗУЛЬТАТ: Проблема частково вирішена, але клієнту не дуже сподобався такий фідбєк від агента. Клієнт на виході нейтральний.
             """
    },


    {
        "id": 3,
        "scenario_name": "conflicting_payment_case",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА МОЛ ДЕ ЙОГО ГРОШІ, ВІН ПЛАТИТЬ ВЖЕ 3-Й РАЗ І ВЖЕ ПОЛІЦІЮ ЗАРАЗ НАКАТАЄ ЗА ШАХРАЙСТВО!!!
             АГЕНТ: Агент відповідє дуже сухо і трохи грубо. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли в очередний раз стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента пише сухе "мгм, дякую за "дуже хороший" сервіс." без капса, де приховує ЯВНЕ НЕЗАДОВОЛЕННЯ СЕРВІСОМ. 
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 4,
        "scenario_name": "payment_agent_mistake",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["incorrect_info", "hallucinated_info"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему з якою зіткнувся абсолютно спокійно. Викладає чіткі факти та старається детально пояснити суть своєї проблеми.
             АГЕНТ: пише з маленької літери, використовує 2-3 слова-паразити "ем", "ну", "корочє" і тд на весь діалог. дає некорректні інструкціїї та показує свою абсолютно некомпетентність. наприклад каже видалити щось важливе або видалити дані з картки, але намагається звучати офіційно.
             КЛІЄНТ: Здивований інструкціями, дійсно збитий з пантелику і перепитує чи впевненний агент.
             АГЕНТ: абсолютно наполягає на своїй правоті і тому, що інструкції вірні. намагається звучати вневнено.
             КЛІЄНТ: все ще здивований, відмовляється від допомоги і ФОРМАЛЬНО вдячний. Насправді збитий з пантелику і в гніві від некомпетентності агентів.
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить незадоволеним.
             """
    },


    {
        "id": 5,
        "scenario_name": "successful_resolution_of_technical_error",
        "intent": "technical_error",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал   - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Трохи схвильовано пояснює свою проблему, може писати з багатьма знаками питання (я точно все так роблю????????/у мене шось зламалось?????), трохи на паніці але пише адекватно. Сподівається на розуміння агента.
             АГЕНТ:Вітає клієнта,пише що розуміє і що таке може трапитися. Виявляє терпіння до клієнта та відповідає професійно, беззайвої холодності. Намагається доступним язиком пояснити в чому може бути причина.
             КЛІЄНТ: Після спроби слідувати інструкціям агента технічна проблема вирішується і клієнт КАПСОМ ДЯКУЄ АГЕНТУ(але без зайвого фанатизму)!!!
             РЕЗУЛЬТАТ: Проблема вирішена, клієнт дуже задоволенний сервісом та розумінням агента.
             """
    },


    {
        "id": 6,
        "scenario_name": "problematic_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Старається спокійно пояснити свою проблему. В тоні відчутнє схвилювання. Питає агента як можна виправити проблему.
             АГЕНТ:Вітає клієнта, відповідає завченими скриптами без каплі емпатії, тільки суха інструкція, пояснює що на данний момент агенти ніяк не можуть повпливати на вирішення проблеми. (вирішення проблеми залежить не від агента)
             КЛІЄНТ: Намагається зрозуміти інструкцію агента але вона не дуже детальна. В кінці кінців все виходить, він дякує агенту. ("ну ок, працює і добре."),
             РЕЗУЛЬТАТ: Проблема не вирішена тому що суть проблеми не залежала від агента, але клієнт лишається в нейтральному настрої бо сервіс був посереднім. 
             """
    },


    {
        "id": 7,
        "scenario_name": "conflicting_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка(серйозна). (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    -  обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА ЗА ТЕ ШО ВОНИ РОБЛЯТЬ ТУПІ САЙТИ ЯКІ ЛАГАЮТЬ ВІД ОДНОГО ТІЛЬКИ ЧІХУ!!! Питає провокуючі фрази по типу: ДА ВИ ЗНАЄТЄ ХТО МІЙ БАТЬКО??? ЯКЩО ВИ ЗАРАЗ НЕ ЗРОБИТЕ ЦЮ ЗАРАЗУ ТО ВСІХ КОНТОРІ КРАНТИ
             АГЕНТ: Агент відповідє дуже сухо і ліниво, ніби робить ласку відповідаючи. Вмикає залізнобетонну стресостійкість, ніякої емпатії. Може ігнорувати деякі питання клієнта.
             КЛІЄНТ: Пише ще як мінімум 2 речення все так же гнівно, і коли вкотре стикається з ОДНИМ І ТИМ САМИМ повідомленням від агента, просто ігнорує. Не дякує, не пише допобачення, просто продивляється повідомлення. Замість репліки клієнта напиши (*Прочитано*)
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим. 
             """
    },


    {
        "id": 8,
        "scenario_name": "technical_agent_mistake",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "unnecessary_escalation"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал  - обрати одну з перелічених тем для діалогу, рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Намагається доступно пояснити свою проблему. Трохи схвильовано але в міру ввічливо.
             АГЕНТ: Агент абсолютно впевнено каже: "Ой-ой, ну це вам точно до адмінісраторів! Ми таким не займаємось." на очевидну помилку котру повинен вирішувати сапорт.
             КЛІЄНТ: Трохи невпевнено перепитує агента чи точно йому треба звертатись до адміна/программістів з такою незначною проблемою.
             АГЕНТ: Відповідає пассивно-агресивно і каже що клієнт повинен або сам вирішувати питання або не ставити зайвих питань і звертатись до когось іншого бо це "не наша зона відповідальності".
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт формально сухо дякує вкінці, але очевидно що він незадоволенний сервісом. 
             """
    },


    {
        "id": 9,
        "scenario_name": "account_success_resolution",
        "intent": "account_access",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           КЛІЄНТ: Дуже шокований і наляканий, пише що в аккаунт не заходить, трохи панікує але старається описати проблему.
           АГЕНТ: Вітає клієнта, емпатично відповідає на проблему. Надає профессійний фідбек та намагається заспокоїти клієнта.
           КЛІЄНТ: Через декілька реплік з агентом нарешті вирішує проблему. В останній репліці відчувається полегшення і клієнт дуже вдячний за допомогу. 
           РЕЗУЛЬТАТ: Проблема вирішена, клієнт задоволений сервісом та оперативністю.
         """
    },


    {
        "id": 10,
        "scenario_name": "account_problematic_case",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["robotic_tone"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           КЛІЄНТ: пише з маленької літери, намагається звучати впевнено але дуже знервованний тим, що зіткнувся з проблемою.
           АГЕНТ: Вітає завченим скриптом, пояснює що вирішення проблеми зараз залежить не від них. Не проявляє емпатії, тільки чітка холодна відповідь.
           КЛЄНТ: формально вдячний, але виявляє приховане незадоволення сервісом. незрозуміло до кого звертатись щоб полагодити проблему.
           РЕЗУЛЬТАТ: Проблема не була вирішена, клієнт залишається незадоволеним через те, що йому треба звертатись в інші незрозумілі сервіси, замість отримання допомоги тут.
         """
    },


    {
        "id": 11,
        "scenario_name": "conflicting_account_case",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution", "robotic_tone"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
          Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
          КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
          КЛІЄНТ: В ПАНІЦІ! Пише капсом і дуже налякано, моментами нерозбірчиво через знервованість. Звинувачує агента в тому що їх сервіс жахливий якщо такі проблеми виникають!
          АГЕНТ: Ніякого співчуття, сухо просить щось підтвердити. Тотально ігнорує емоції клієнта, відповідаючи як робот. 
          КЛІЄНТ: Починає сильніше панікувати та дуже сильно гнати на агента, що він некомпетентний і що він буде за таке як мінімум жалобу писати!
          АГЕНТ: Ігнорує запити.
          КЛІЄНТ: Не дякує, не відповідає агенту. В кінці тільки *Прочитано*.
          РЕЗУЛЬТАТ: Клієнт ДУЖЕ незадоволенний! Проблему вирішено не було, агент відповідає взагалі не по запиту клієнта!
         """
    },


    {
        "id": 12,
        "scenario_name": "account_agent_mistake",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "unnecessary_escalation", "rude_tone", "too_short_reply"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
          КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
          КЛІЄНТ: Вітається, спокійно та стриманно пояснює свою проблему агенту.
          АГЕНТ: Пише дуже мало не привітавшись, наприклад: Це не до нас.
          КЛІЄНТ: Намагається зрозуміти до кого йому звернутись з конкретно цією проблемою.
          АГЕНТ: Виявляє приховану пассивну агресію. Пише щось типу: Ну то до адміністратора з цим звертайтесь, шановна/шановний. Проявляє максимальну пассивну роздратованість, яка переходить в грубий тон.
          КЛІЄНТ: В шоці від такого сервісу, невпенено дякує, але це лише формальність.
          РЕЗУЛЬТАТ: Проблема не вирішена, клієнт вийшов шокованим від некомпетентності сервісу. Формальна вдячність в кінці повинна показувати незадоволеність. 
         """
    },


    {
        "id": 13,
        "scenario_name": "tariff_success_resolution",
        "intent": "tariff_question",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пише з питанням, спокійно та абсолютно нейтрально.
         АГЕНТ: Вітає клієнта, швидко та оперативно відповідає, активно уточнює деталі питання клієнта. Вирішує питання клієнта, надає детальну інструкцію та терпляче відноситься навіть до самих нелогічних питань клієнта. Не хамить і відповідає відкрито.
         КЛІЄНТ: Чітко виконує інструкції. Дякує агенту за оперативність та проффесіональність.
         РЕЗУЛЬТАТ: Проблема була швидко та професійно вирішена. Клієнт залишається задоволеним оперативністю та відповідальністю сервісу.
         """
    },


    {
        "id": 14,
        "scenario_name": "tariff_problematic_case",
        "intent": "tariff_question",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пояснює свою проблему пов'язану з тарифом агенту, тон нейтральний та не хамовитий.
         АГЕНТ: Вітає клієнта, спокійно пояснює, що проблема, яку описав клієнт, неможливо зараз вирішити, бо її вирішення на данний момент не залежить від сервісу.
         КЛІЄНТ: Ставиться розуміюче, намагається зрозуміти чому сервіс зараз не може повпливати на вирішення. Пише без агресії, просто намагається зрозуміти в чому справа.
         АГЕНТ: Терпляче відповідає на всі питання клієнта, показує свій професіоналізм, але проблему вирішити не може. 
         КЛІЄНТ: В кінці формально дякує.
         РЕЗУЛЬТАТ: Проблему не було вирішено, але через те, що агент ставився терпляче та розуміюче, клієнт виходить в нейтральному настрої.
             """
    },


    {
        "id": 15,
        "scenario_name": "conflicting_tariff_case",
        "intent": "tariff_question",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["rude_tone", "no_resolution", "passive_aggression", "jargon_overload"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Починає діалог з агентом трохи роздратовано. Питання не дуже значне, але дратує його наявність.
         АГЕНТ: Вітається з клієнтом, пише холодно. В повідомленні відчувається пасивна агрессія.
         КЛІЄНТ: В шоці і починає вже набагато явніше агрессувати на агента за те, що він не може нормально вирішити проблему. Навіть не дивлячись на те, що в минулому повідомленні агент щось намагався пояснити. В кінці додає: Чому ви не можете вирішити моє питання? В чому ваша проблема?
         АГЕНТ: Починає відповідати агрессією на агрессію, але не в прямому форматі, а через: грубий тон, надмірність, пассивну агрессію. При цьому НАМАГАЄТЬСЯ відповідати проффесійно, що виходить не дуже. Використовує заумні терміни щоб "поставити клієнта на місце".
         РЕЗУЛЬТАТ: Клієнт виходить розлюченим через жахливий сервіс. Питання не було вирішено, а агент довів до агрессії замість того, щоб вирішити питання.
             """
    },


    {
        "id": 16,
        "scenario_name": "tariff_agent_mistake",
        "intent": "tariff_question",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["incorrect_info", "contradictory_info", "outdated_info","no_resolution", "overly_verbose", "assumption_based_reply"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пише з запитанням стосовно теми, нейтральний тон, просто зіткнувся з якимись незрозумілими данними.
         АГЕНТ: Намагається втюхати клієнту інформацію зі старого шаблону, якому вже років 10. Але говорить про це дуже впевнено та рішуче.
         КЛІЄНТ: Перепитує агента. Показує скрін з сайта, де написано зовсім інші інструкції. 
         АГЕНТ: Негайно перелаштовується та починає перечити сам собі, кажучи: ну так, так. я саме це і мав на увазі. Потім починає по інструкції зі скріна клієнта пояснювати щсоь, що вже не стосується питання тарифу. Починає перегружати відповідь непотрібним текстом, що не вирішує питання ніяким чином.
         КЛІЄНТ:Перебиває агента, та починає казати що ця відповідь ніяк не стосується питання про тариф.
         АГЕНТ: Знову починає піддакувати клієнту та знову перечити своїм же інструкціям.
         КЛІЄНТ: Зупиняє агента, пише зось в дусі: окей, все. я зрозумів вас. дякую.
         РЕЗУЛЬТАТ: Проблема не була вирішена, клієнта нагрузили непотрібною інформацією та застарілою інформацією. Хоч агент і намагався звучати впевнено, але користі ніякої не приніс.
              """
    },


    {
        "id": 17,
        "scenario_name": "refund_success_resolution",
        "intent": "refund_request",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо поверення коштів.
         КОНТЕКСТ:
             [ТВІЙ ПРОМПТ ТУТ: Клієнт просить повернути гроші. Агент все робить ідеально і швидко.]
         """
    },


    {
        "id": 18,
    },


    {
        "id": 19,
    },


    {
        "id": 20,
    }

]