
SCENARIOS = [
    {
    "id": 1,
        "scenario_name": "payment_success_resolution",
        "intent": "payment_issue",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему без зайвої агресії, де в нього виникла проблема оплати. Наприклад: підписка. 
             АГЕНТ: Намагається бути тактовним та оперативним. Дає чітке пояснення в чому може бути проблема.
             Пропонує конкретні кроки щоб вирішити: перевірити карту, спосіб оплати та просить повторити спробу. Допомогає вирішити.
             КЛІЄНТ: Дякує агенту, проблема вирішена тому кліент залишається задоволеним.
             РЕЗУЛЬТАТ: Проблема вирішена! 
             """
    },


    {
        "id": 2,
        "scenario_name": "payment_problematic_case",
        "intent": "payment_issue",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює, де в нього виникла проблема оплати. Наприклад: підписка.
             АГЕНТ: Агент відповідє тільки завченими скриптами, без каплі емпатії. Технічно він правий, але клієнту не легше від цього. Пояснює, що сталося і що зараз компанія не може повпливати на цю проблему. (проблема в банку або в чомусь іншому)
             КЛІЄНТ: Невпевнено дякує агенту...
             РЕЗУЛЬТАТ: Проблема частково вирішена, але клієнту не дуже сподобався такий сухий фідбєк від агента. Клієнт на виході нейтральний.
             """
    },


    {
        "id": 3,
        "scenario_name": "conflicting_payment_case",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА ЩО ВІН ВЖЕ 500-Й РАЗ НАМАГАЄТЬСЯ ОПЛАТИТИ І НІЧОГО НЕ ВИХОДИТЬ!!! ПИШЕ ЩО ПОМИЛКА. Клієнт може не попадати по клавіатурі через емоціональність, тому ДЕЯКІ слова виходять трохи нерозбірливо. Коми та крапки в кінці речення не використовує.
             АГЕНТ: Агент намагається заспокоїти клієнта, та пише що вони вже працюють з проблемою. Намагається бути стрессостійким, але клієнт починає давити на агента, через що виходить трохи ніяково.
             КЛІЄНТ: Намагається слідувати інструкціям агента, але після ще одної невдалої сброби кидає матом в агента.
             АГЕНТ: Намагається ще раз пояснити клієнту в чому проблема і що зараз все вирішиться. 
             КЛІЄНТ: Після ще одної спроби, все нарешті працює. Він не дякує в кінці, а просто холодним тоном пише якесь коротке повідомлення "вдячність".
             РЕЗУЛЬТАТ: Проблема вирішена, але клієнт залишився незадоволенний сервісом, не дивлячись на те, що агент намагався людяно донести інформацію.
             """
    },


    {
        "id": 4,
        "scenario_name": "payment_agent_mistake",
        "intent": "payment_issue",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "hallucinated_info", "no_resolution"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з оплатою.
             КОНТЕКСТ: У клієнта виникає помилка при спробі оплати.
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему з якою зіткнувся абсолютно спокійно. Викладає чіткі факти та старається детально пояснити суть своєї проблеми.
             АГЕНТ: пише з маленької літери, використовує 2-3 слова-паразити "ем", "ну", "корочє" і тд на весь діалог. дає некорректні, придумані інструкціїї та показує свою абсолютно некомпетентність. наприклад каже видалити щось важливе або видалити дані з картки, але намагається звучати офіційно, абсолютно вірячи в свою правоту.
             КЛІЄНТ: Здивований інструкціями, дійсно збитий з пантелику і перепитує чи впевненний агент.
             АГЕНТ: наполягає на своїй правоті і тому, що інструкції вірні. намагається звучати вневнено.
             КЛІЄНТ: все ще здивований, відмовляється від допомоги і ФОРМАЛЬНО вдячний. Насправді збитий з пантелику і в гніві від некомпетентності агентів. В повідомленні повинна відчуватись прихована агрессія.
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить незадоволеним.
             """
    },


    {
        "id": 5,
        "scenario_name": "successful_resolution_of_technical_error",
        "intent": "technical_error",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction":
            """
             ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал   - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Пише як село, використовує суржик та закарпатські діалекти в своїх поясненнях. Тон спокійний, нейтральний. Клієнт розуміє що помилка незначна, та сподіваєтся на допомогу агента.
             АГЕНТ: Вітає клієнта на літературній українській мові, намагається зрозуміти повідомлення клієнта. Перепитує та уточнює у клієнта деталі, щоб правильно трактувати повідомлення. Намагається доступним язиком пояснити в чому може бути причина.
             КЛІЄНТ: Після спроби слідувати інструкціям агента технічна проблема вирішується і клієнт дякує в тому ж стилі що і раніше.
             РЕЗУЛЬТАТ: Проблема вирішена, клієн задоволенний сервісом та чіткими інструкціями.
             """
    },


    {
        "id": 6,
        "scenario_name": "problematic_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (6-7 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    - обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Коротко описує свою проблему, питає як вирішити.
             АГЕНТ:Вітає клієнта, відповідає завченими скриптами без каплі емпатії, тільки суха інструкція, пояснює що на данний момент агенти ніяк не можуть повпливати на вирішення проблеми. (вирішення проблеми залежить не від агента)
             КЛІЄНТ: Перепитує до кого тоді звернутися щоб скоріше вирішити. 
             АГЕНТ: Пише що тут тільки очікувати, зараз проблему не вирішити.
             РЕЗУЛЬТАТ: Проблема не вирішена тому що суть проблеми не залежала від агента, але клієнт лишається в нейтральному настрої бо сервіс був посереднім.
             """
    },


    {
        "id": 7,
        "scenario_name": "conflicting_technical_case",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка(серйозна). (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал    -  обрати одну з перелічених проблем для діаплогу. рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: ПИШЕ КАПСОМ ТА ОРЕ НА АГЕНТА ЗА ТЕ ШО ВОНИ РОБЛЯТЬ ТУПІ САЙТИ ЯКІ ЛАГАЮТЬ ПОСТІЙНО!!! ЗВИНУВАЧУЄ ГОРЕ-ПРОГРАМІСТІВ, ТА БЕЗРУКИХ МЕНЕДЖЕРІВ. ПИШЕ ЯК ЙОГО ЦЕ ДІСТАЛИ ПОСТІЙНІ ЛАГИ.
             АГЕНТ: Пише щось в дусі: "Доброго дня! Бачимо ваше звернення! " - після цього намагається звучати завченою "доброю" моделлю діалогу, максимально ігноруючи агрессію клієнта. 
             КЛІЄНТ: Починає ще більше дратуватись і вже конкретно крити агента матом, наплював на етикет. 
             АГЕНТ: Пише ТЕ Ж САМЕ ПОВІДОМЛЕННЯ з привітанням як заївший скрипт. Два рази підряд.
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт виходить розлюченим через ігнорування його запросів.
             """
    },


    {
        "id": 8,
        "scenario_name": "technical_agent_mistake",
        "intent": "technical_error",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "unnecessary_escalation"],
        "prompt_instruction":
            """
            ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
             Сгенеруй діалог на українській мові (7-8 речень). Клієнт має технічні проблеми.
             КОНТЕКСТ: У клієнта виникає технічна помилка. (Нескінченне завантаження сторінки/Помилки сервера(404/500) при спробі зайти на сайт/Зламаний функціонал  - обрати одну з перелічених тем для діалогу, рандомно.)
             ПЕРША РЕПЛІКА КЛІЄНТА: Пояснює проблему, це незначна та разова тому спокійно намагається з'ясувати в чому справа.
             АГЕНТ: Агент абсолютно впевнено каже: "Ой-ой, ну це вам точно до адмінісраторів! Ми таким не займаємось." на очевидну помилку котру повинен вирішувати сапорт.
             КЛІЄНТ: Трохи невпевнено перепитує агента чи точно йому треба звертатись до адміна/программістів з такою незначною проблемою.
             АГЕНТ: Відповідає пассивно-агресивно і каже що клієнт повинен або сам вирішувати питання або не ставити зайвих питань і звертатись до когось іншого бо це "не наша зона відповідальності".
             РЕЗУЛЬТАТ: Проблема не вирішена, клієнт формально сухо дякує вкінці, але очевидно що він незадоволенний сервісом. Потрібно показати все незадоволення клієнта в формальному прощанні.
             """
    },


    {
        "id": 9,
        "scenario_name": "account_success_resolution",
        "intent": "account_access",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           КЛІЄНТ: Дуже шокований і наляканий, пише що в аккаунт не заходить. На паніці не попадає по клавішам та репліки виходять панікуючі. Клієнт впадає в паранойю що його дані вкрадено, і запрос до агента виявляєтся складно зрозуміти.
           АГЕНТ: Оперативно та швидко реагує. Намагається заспокоїти клієнта і каже що вони вже заблокували всі підозрілі дії на аккаунтй (якщо тема діалогу це взлом.). Вирішує проблему та парралельно інформує клієнта про те, що відбувається.
           КЛІЄНТ: Заспокоюється коли агент каже що всі данні цілі. Дуже дякує за допомогу та швидкі дії в такій ситуації.
           РЕЗУЛЬТАТ: Проблема вирішена, клієнт задоволений сервісом та оперативністю.
         """
    },


    {
        "id": 10,
        "scenario_name": "account_problematic_case",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["robotic_tone"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
           Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
           КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
           КЛІЄНТ: пише з маленької літери, намагається звучати впевнено але дуже знервованний тим, що зіткнувся з проблемою.
           АГЕНТ: Вітає завченим скриптом, пояснює що вирішення проблеми зараз залежить не від них. Не проявляє емпатії, тільки чітка холодна відповідь.
           КЛЄНТ: формально вдячний, але виявляє приховане незадоволення сервісом. незрозуміло до кого звертатись щоб полагодити проблему.
           РЕЗУЛЬТАТ: Проблема не була вирішена, клієнт залишається незадоволеним через те, що йому треба звертатись в інші незрозумілі сервіси, замість отримання допомоги тут.
         """
    },


    {
        "id": 11,
        "scenario_name": "conflicting_account_case",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["ignored_question", "no_resolution", "robotic_tone"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
          Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
          КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
          КЛІЄНТ: В ПАНІЦІ! Пише капсом що в нього все злетіло, моментами нерозбірчиво через знервованість. Звинувачує агента в тому що їх сервіс жахливий якщо такі проблеми виникають!
          АГЕНТ: Ніякого співчуття, сухо просить щось підтвердити. Тотально ігнорує емоції клієнта, відповідаючи як робот. 
          КЛІЄНТ: Починає сильніше панікувати та дуже сильно гнати на агента, що він некомпетентний і що він буде за таке як мінімум жалобу писати!
          АГЕНТ: Ігнорує запити.
          КЛІЄНТ: Не дякує, не відповідає агенту. В кінці тільки *Прочитано*.
          РЕЗУЛЬТАТ: Клієнт ДУЖЕ незадоволенний! Проблему вирішено не було, агент відповідає взагалі не по запиту клієнта!
         """
    },


    {
        "id": 12,
        "scenario_name": "account_agent_mistake",
        "intent": "account_access",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["incorrect_info", "unnecessary_escalation", "rude_tone", "too_short_reply"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має проблеми з аккаунтом. 
          КОНТЕКСТ: У клієнта сталася проблема з аккаунтом (забув пароль/взломали/проблеми з 2FA/заблоковані профілі    - обрати одну з перелічених проблем для діаплогу. рандомно.), він звертається до агента.
          КЛІЄНТ: Вітається, спокійно та стриманно пояснює свою проблему агенту. Питає як зайти на аккаунт.
          АГЕНТ: Пише дуже мало, не привітавшись, наприклад: Це не до нас.
          КЛІЄНТ: Намагається зрозуміти до кого йому звернутись з конкретно цією проблемою.
          АГЕНТ: Виявляє приховану пассивну агресію. Пише щось типу: Ну то до адміністратора з цим звертайтесь, шановна/шановний. Проявляє максимальну пассивну роздратованість, яка переходить в грубий тон.
          КЛІЄНТ: В шоці від такого сервісу, починає відкрито агрессувати на агента за таке обслуговування. Пояснює ще раз що на аккаунт зовсім неможливо зайти! 
          АГЕНТ: Знову відповідає дуже коротко, навіть не намагаючись зрозуміти суть проблеми клієнта.
          РЕЗУЛЬТАТ: Проблема не вирішена, клієнт вийшов шокованим від некомпетентності сервісу. Формальна вдячність в кінці повинна показувати незадоволеність. 
         """
    },


    {
        "id": 13,
        "scenario_name": "tariff_success_resolution",
        "intent": "tariff_question",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пише з питанням, спокійно та абсолютно нейтрально, не привітавшись. 
         АГЕНТ: Вітає клієнта, швидко та оперативно відповідає, активно уточнює деталі питання клієнта. Вирішує питання клієнта, надає детальну інструкцію та терпляче відноситься навіть до самих нелогічних питань клієнта. Не хамить і відповідає відкрито.
         КЛІЄНТ: Чітко виконує інструкції. Може писати щось типу (Тю, шо за фігня) якщо не вийде з першого разу. Агент терпляче розбереться з проблемою. В кінці проблему вирішено, клієнт дякує агенту за оперативність та проффесіональність.
         РЕЗУЛЬТАТ: Проблема була швидко та професійно вирішена. Клієнт залишається задоволеним оперативністю та відповідальністю сервісу.
         """
    },


    {
        "id": 14,
        "scenario_name": "tariff_problematic_case",
        "intent": "tariff_question",
        "expected_satisfaction": "neutral",
        "expected_quality_score": 3,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пояснює свою проблему пов'язану з тарифом агенту, тон нейтральний та не хамовитий.
         АГЕНТ: Вітає клієнта, спокійно пояснює, що проблема, яку описав клієнт, неможливо зараз вирішити, бо її вирішення на данний момент не залежить від сервісу.
         КЛІЄНТ: Ставиться розуміюче, намагається зрозуміти чому сервіс зараз не може повпливати на вирішення. Пише без агресії, просто намагається зрозуміти в чому справа.
         АГЕНТ: Терпляче відповідає на всі питання клієнта, показує свій професіоналізм, але проблему вирішити не може. 
         КЛІЄНТ: В кінці формально дякує.
         РЕЗУЛЬТАТ: Проблему не було вирішено, але через те, що агент ставився терпляче та розуміюче, клієнт виходить в нейтральному настрої.
             """
    },


    {
        "id": 15,
        "scenario_name": "conflicting_tariff_case",
        "intent": "tariff_question",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 1,
        "expected_mistakes": ["rude_tone", "no_resolution", "passive_aggression", "jargon_overload"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Починає діалог з агентом трохи роздратовано. Питання не дуже значне, але дратує його наявність.
         АГЕНТ: Вітається з клієнтом, пише холодно. З першого повідомлення відчутна пассивна агрессія і незадоволення у агента.
         КЛІЄНТ: В шоці і починає вже набагато явніше агрессувати на агента за те, що він не може нормально вирішити проблему. Навіть не дивлячись на те, що в минулому повідомленні агент щось намагався пояснити. В кінці додає: Чому ви не можете вирішити моє питання? В чому ваша проблема?
         АГЕНТ: Починає відповідати агрессією на агрессію, але не в прямому форматі, а через: грубий тон, надмірність, пассивну агрессію. При цьому НАМАГАЄТЬСЯ відповідати проффесійно, що виходить не дуже. Використовує заумні терміни щоб "поставити клієнта на місце".
         РЕЗУЛЬТАТ: Клієнт виходить розлюченим через жахливий сервіс. Питання не було вирішено, а агент довів до агрессії замість того, щоб вирішити питання.
             """
    },


    {
        "id": 16,
        "scenario_name": "tariff_agent_mistake",
        "intent": "tariff_question",
        "expected_satisfaction": "unsatisfied",
        "expected_quality_score": 2,
        "expected_mistakes": ["incorrect_info", "contradictory_info", "outdated_info","no_resolution", "overly_verbose", "assumption_based_reply"],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо тарифу.
         КОНТЕКСТ: У клієнта виникає абсолютно логічне питання стосовно тарифів у сервісі. Він пише щоб уточнити деякі деталі. (Умови тарифу/Зміна пакету з одного на інший/Де знайти деталі про тариф   - обери одну з тем для діалогу, рандомно.)
         КЛІЄНТ: Пише з запитанням стосовно теми, нейтральний тон, просто зіткнувся з якимись незрозумілими данними.
         АГЕНТ: Намагається втюхати клієнту інформацію зі старого шаблону, якому вже років 10. Але говорить про це дуже впевнено та рішуче. Рекламує якусь фігню з сайту яка не пов'язана з питанням тарифу.
         КЛІЄНТ: Перепитує агента. Показує скрін з сайта, де написано зовсім інші інструкції. 
         АГЕНТ: Негайно перелаштовується та починає перечити сам собі, кажучи: ну так, так. я саме це і мав на увазі. Потім починає по інструкції зі скріна клієнта пояснювати щсоь, що вже не стосується питання тарифу. Починає перегружати відповідь непотрібним текстом, що не вирішує питання ніяким чином.
         КЛІЄНТ:Перебиває агента, та починає казати що ця відповідь ніяк не стосується питання про тариф.
         АГЕНТ: Знову починає піддакувати клієнту та знову перечити своїм же інструкціям.
         КЛІЄНТ: Зупиняє агента, пише зось в дусі: окей, все. я зрозумів вас. дякую.
         РЕЗУЛЬТАТ: Проблема не була вирішена, клієнта нагрузили непотрібною інформацією та застарілою інформацією. Хоч агент і намагався звучати впевнено, але користі ніякої не приніс.
              """
    },


    {
        "id": 17,
        "scenario_name": "refund_success_resolution",
        "intent": "refund_request",
        "expected_satisfaction": "satisfied",
        "expected_quality_score": 5,
        "expected_mistakes": [],
        "prompt_instruction": """
        ЖОРСТКЕ ПРАВИЛО ФОРМАТУВАННЯ: Виведи СУВОРО ТІЛЬКИ репліки діалогу. Заборонено писати вступні фрази (типу "Ось діалог:"), заборонено писати висновки в кінці ("Результат:"), заборонено використовувати ремарки в дужках (типу "(роздратовано)"), заборонено використовувати списки. Тільки чистий текст у форматі Клієнт: ... Агент: ...
         Сгенеруй діалог на українській мові (7-8 речень). Клієнт має питання щодо поверення коштів.
         КОНТЕКСТ: Клієнт вирішує відмінити: покупку/підписку/якийсь товар -- одну тему для діалогу обрати рандомно 
         КЛІЄНТ: Пише просто верніть мені мої гроші. Вимагаючи, без дякую і без допобачення.
         АГЕНТ: Вітається з клієнтом, перепитує який саме товар повернув клієнт, просить чек та підтверждення.
         КЛІЄНТ: Пише щось незрозуміле.
         АГЕНТ: Пере
        
         """
    },


    {
        "id": 18,
    },


    {
        "id": 19,
    },


    {
        "id": 20,
    }

]